.src/SQLServer/d-tsql.org
#+TITLE: Transact-SQL



* T-SQL

- 什么是 T-SQL?

** 批处理 (go)

#+begin_src sql
  select * from emp;
  select * frmo dept; -- 如果这条出问题，上边一条也不会被执行
  go
  select * from emp;
  go
#+end_src

小结:
- GO 并不是标准的 SQL 关键词
- GO 的作用是 *批处理*，它会将之前的若干语句一起编译并发送给服务器去执行
- 一个批处理中的语句，如果有一条编译出错，它们整个批中的命令都将不会执行

** 脚本 (Script)

你可以将所有的 sql 语句保存到一个后缀名为 sql 的文件中:
- 方便编辑
- 可以永久化保存
- 可以导入执行

比如，保存为 D:/xxx.sql:
#+begin_src sql
  use xxx;
  go

  select * from emp;
  select * from emp;

  go

  create table xyz 
  (
      id int
  );

  insert into xyz values (1), (2);
#+end_src

* 变量 (Variable)
** 变量的命名

- 以 ACII ... 等开头，不能使用保留字，不允许空格和特殊字符
- 虽然可以使用中文，但是不建议
- 一些不符合标准的名字，可以使用 [] 或者 "" 的方式引起来

** 局部变量

局部变量的声明周期是一个 P:
- 是用户定义的，作用在一个 P 范围内的变量
- 名字必须要以 @ 开始
- 使用 declare 定义，使用 set/select 赋值，使用 select 查看值

基本定义语句:
#+begin_src sql
  -- 例子 1
  declare @sss int;   -- 声明
  set @sss = 2000;    -- 赋值
  select @sss;        -- 查看
  select * from emp where sal > @sss; -- 使用

  -- 例子 2
  declare @s int, @job varchar(20);
  set @s = 1000;
  select @job = 'sales';
  select * from emp where sal > @s and job like @job + '%';
  select @s;

  -- 例子 3，可以将查询的结果保存到变量中
  declare @s int;
  select @s=sal from emp where empno = 7499;
  select * from emp where sal >= @s;
#+end_src

** 全局变量

服务器内部使用的一些变量，通过修改它们，可以影响服务器的行为。

用户只能修改这些变量，不能删除、创建它们。

分为两种，一种是静态的，一种是动态的:
#+begin_src sql
  -- 每次查询都会不变
  select @@VERSION;

  -- 每次查询，会根据实际情况返回相应数据
  delete from emp where sal < 1200;
  select @@ROWCOUNT;
#+end_src

常见的全局变量:
- @@connections / @@dbts / @@cpu_busy / @version;
- @@rowcount
- @@cursor_rows
- @@error !!! 如果不出错，返回 0
- @@identity

* 逻辑处理
