html/SQLServer/d-tsql.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-01-22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Transact-SQL</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliusan/html/asset/common.css?3344' />

</head>
<body>
<div id="content">
<header>
<h1 class="title">Transact-SQL</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7a090e7">1. T-SQL</a>
<ul>
<li><a href="#org8c8b542">1.1. 批处理 (go)</a></li>
<li><a href="#org377dc78">1.2. 脚本 (Script)</a></li>
</ul>
</li>
<li><a href="#orgd801a68">2. 变量 (Variable)</a>
<ul>
<li><a href="#org8277377">2.1. 变量的命名</a></li>
<li><a href="#org51dd127">2.2. 局部变量</a></li>
<li><a href="#org0b16ad6">2.3. 全局变量</a></li>
</ul>
</li>
<li><a href="#orgc39681d">3. 逻辑处理</a>
<ul>
<li><a href="#orgbebad28">3.1. if/else</a></li>
<li><a href="#orgb25c1c7">3.2. while</a></li>
<li><a href="#orgcf202a7">3.3. return/returns</a></li>
<li><a href="#orgad1e10e">3.4. waitfor</a></li>
<li><a href="#orgb95838c">3.5. print</a></li>
<li><a href="#orgb75f8d5">3.6. raiserror</a></li>
<li><a href="#org651c5dc">3.7. case-when (很重要)</a></li>
</ul>
</li>
<li><a href="#org1c56ac1">4. 函数 (Function)</a>
<ul>
<li><a href="#orge707bd2">4.1. 什么是函数</a></li>
<li><a href="#org2694676">4.2. 创建函数</a></li>
<li><a href="#org909ed82">4.3. 内置函数</a>
<ul>
<li><a href="#orgc008341">4.3.1. 数学函数</a></li>
<li><a href="#org4adf561">4.3.2. 字符串相关</a></li>
<li><a href="#org900850b">4.3.3. 日期相关</a></li>
<li><a href="#org9ddd2bd">4.3.4. 类型转换 (cast/convert) !!!</a></li>
<li><a href="#orgb4b92c8">4.3.5. 其他</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org20ebb10">5. 存储过程 (Procedure)</a>
<ul>
<li><a href="#org9e5c5c3">5.1. 什么是存储过程</a></li>
<li><a href="#org11a99c8">5.2. 创建存储过程</a>
<ul>
<li><a href="#org1142799">5.2.1. 基本语句</a></li>
<li><a href="#orge736edb">5.2.2. 各种参数</a></li>
</ul>
</li>
<li><a href="#orgd882344">5.3. 简单示例 (统计)</a></li>
<li><a href="#org1a5971b">5.4. 内置存储过程</a></li>
</ul>
</li>
<li><a href="#org26058ee">6. 触发器 (Trigger)</a>
<ul>
<li><a href="#org7f508b1">6.1. 什么是触发器</a></li>
<li><a href="#orgfb4632c">6.2. 创建触发器</a></li>
</ul>
</li>
<li><a href="#org167f2d1">7. 常见问题</a></li>
</ul>
</div>
</nav>



<section id="outline-container-org7a090e7" class="outline-2">
<h2 id="org7a090e7"><span class="section-number-2">1</span> T-SQL</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>什么是 T-SQL?</li>
</ul>
</div>

<div id="outline-container-org8c8b542" class="outline-3">
<h3 id="org8c8b542"><span class="section-number-3">1.1</span> 批处理 (go)</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp;
<span style="color: #c678dd; font-weight: bold;">select</span> * frmo dept; <span style="color: #687080; font-style: italic;">-- &#22914;&#26524;&#36825;&#26465;&#20986;&#38382;&#39064;&#65292;&#19978;&#36793;&#19968;&#26465;&#20063;&#19981;&#20250;&#34987;&#25191;&#34892;</span>
<span style="color: #c678dd; font-weight: bold;">go</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp;
<span style="color: #c678dd; font-weight: bold;">go</span>
</pre>
</div>

<p>
小结:
</p>
<ul class="org-ul">
<li>GO 并不是标准的 SQL 关键词</li>
<li>GO 的作用是 <b>批处理</b>，它会将之前的若干语句一起编译并发送给服务器去执行</li>
<li>一个批处理中的语句，如果有一条编译出错，它们整个批中的命令都将不会执行</li>
</ul>
</div>
</div>

<div id="outline-container-org377dc78" class="outline-3">
<h3 id="org377dc78"><span class="section-number-3">1.2</span> 脚本 (Script)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
你可以将所有的 sql 语句保存到一个后缀名为 sql 的文件中:
</p>
<ul class="org-ul">
<li>方便编辑</li>
<li>可以永久化保存</li>
<li>可以导入执行</li>
</ul>

<p>
比如，保存为 D:/xxx.sql:
</p>
<div class="org-src-container">
<pre class="src src-sql">use xxx;
<span style="color: #c678dd; font-weight: bold;">go</span>

<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp;

<span style="color: #c678dd; font-weight: bold;">go</span>

<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">xyz</span>
<span style="color: #8c8c8c;">(</span>
    id <span style="color: #61afef;">int</span>
<span style="color: #8c8c8c;">)</span>;

<span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> xyz <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span>1<span style="color: #8c8c8c;">)</span>, <span style="color: #8c8c8c;">(</span>2<span style="color: #8c8c8c;">)</span>;
</pre>
</div>
</div>
</div>
</section>

<section id="outline-container-orgd801a68" class="outline-2">
<h2 id="orgd801a68"><span class="section-number-2">2</span> 变量 (Variable)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8277377" class="outline-3">
<h3 id="org8277377"><span class="section-number-3">2.1</span> 变量的命名</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>以 ACII &#x2026; 等开头，不能使用保留字，不允许空格和特殊字符</li>
<li>虽然可以使用中文，但是不建议</li>
<li>一些不符合标准的名字，可以使用 [] 或者 "" 的方式引起来</li>
</ul>
</div>
</div>

<div id="outline-container-org51dd127" class="outline-3">
<h3 id="org51dd127"><span class="section-number-3">2.2</span> 局部变量</h3>
<div class="outline-text-3" id="text-2-2">
<p>
局部变量的声明周期是一个 P:
</p>
<ul class="org-ul">
<li>是用户定义的，作用在一个 P 范围内的变量</li>
<li>名字必须要以 @ 开始</li>
<li>使用 declare 定义，使用 set/select 赋值，使用 select 查看值</li>
</ul>

<p>
基本定义语句:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#20363;&#23376; 1</span>
<span style="color: #c678dd; font-weight: bold;">declare</span> @sss <span style="color: #61afef;">int</span>;   <span style="color: #687080; font-style: italic;">-- &#22768;&#26126;</span>
<span style="color: #c678dd; font-weight: bold;">set</span> @sss = 2000;    <span style="color: #687080; font-style: italic;">-- &#36171;&#20540;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> @sss;        <span style="color: #687080; font-style: italic;">-- &#26597;&#30475;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> sal &gt; @sss; <span style="color: #687080; font-style: italic;">-- &#20351;&#29992;</span>

<span style="color: #687080; font-style: italic;">-- &#20363;&#23376; 2</span>
<span style="color: #c678dd; font-weight: bold;">declare</span> @s <span style="color: #61afef;">int</span>, @job <span style="color: #61afef;">varchar</span><span style="color: #8c8c8c;">(</span>20<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">set</span> @s = 1000;
<span style="color: #c678dd; font-weight: bold;">select</span> @job = <span style="color: #98be65;">'sales'</span>;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> sal &gt; @s <span style="color: #c678dd; font-weight: bold;">and</span> job <span style="color: #c678dd; font-weight: bold;">like</span> @job + <span style="color: #98be65;">'%'</span>;
<span style="color: #c678dd; font-weight: bold;">select</span> @s;

<span style="color: #687080; font-style: italic;">-- &#20363;&#23376; 3&#65292;&#21487;&#20197;&#23558;&#26597;&#35810;&#30340;&#32467;&#26524;&#20445;&#23384;&#21040;&#21464;&#37327;&#20013;</span>
<span style="color: #c678dd; font-weight: bold;">declare</span> @s <span style="color: #61afef;">int</span>;
<span style="color: #c678dd; font-weight: bold;">select</span> @s=sal <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> empno = 7499;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> sal &gt;= @s;
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b16ad6" class="outline-3">
<h3 id="org0b16ad6"><span class="section-number-3">2.3</span> 全局变量</h3>
<div class="outline-text-3" id="text-2-3">
<p>
服务器内部使用的一些变量，通过修改它们，可以影响服务器的行为。
</p>

<p>
用户只能修改这些变量，不能删除、创建它们。
</p>

<p>
分为两种，一种是静态的，一种是动态的:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#27599;&#27425;&#26597;&#35810;&#37117;&#20250;&#19981;&#21464;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> @@VERSION;

<span style="color: #687080; font-style: italic;">-- &#27599;&#27425;&#26597;&#35810;&#65292;&#20250;&#26681;&#25454;&#23454;&#38469;&#24773;&#20917;&#36820;&#22238;&#30456;&#24212;&#25968;&#25454;</span>
<span style="color: #c678dd; font-weight: bold;">delete</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> sal &lt; 1200;
<span style="color: #c678dd; font-weight: bold;">select</span> @@ROWCOUNT;
</pre>
</div>

<p>
常见的全局变量:
</p>
<ul class="org-ul">
<li>@@connections / @@dbts / @@cpu_busy / @version;</li>
<li>@@rowcount</li>
<li>@@cursor_rows</li>
<li>@@error !!! 如果不出错，返回 0</li>
<li>@@identity</li>
</ul>
</div>
</div>
</section>
