.src/SQLServer/d-tsql.org
** if/else

基本句式:
#+begin_src sql
  if 条件
    操作
  else if
    操作
  else
    操作
#+end_src

例子:
#+begin_src sql
 -- 给某个人加工资 (7499)
 --  如果工资小于 1500 加上 1000
 --  如果工资小于 3000 加上 500
 --  如果工资大于等于 3000 加上 50

 declare @empno int;
 set @empno = 7499;

 if (select sal from emp where empno = @empno) < 1500
   begin
     update emp set sal = sal + 1000 where empno = @empno;
     insert into my_log (message) values ('money is so cool.');
   end
 else if (select sal from emp where empno = @empno) < 3000
   begin
     update emp set sal = sal + 500 where empno = @empno;
     insert into my_log (message) values ('what a pity.');
   end
 else
   begin
     update emp set sal = sal + 50 where empno = @empno;
     insert into my_log (message) values ('fxxxxxk.');
   end
#+end_src

** while

基本句式:
#+begin_src sql
  while 条件
    语句
#+end_src

示例:
#+begin_src sql
  -- 向数据库中插入 1000000 条测试数据

  declare @count int;
  set @count = 1000000;
  while @count > 0
    begin
        insert into my_log (message) values ('hello');
        set @count = @count - 1
    end
#+end_src

** return/returns

无条件返回。

** waitfor

计时器，可以指定计划任务，比如，晚上对数据做一些统计性的工作。

#+begin_src sql
  waitfor delay '00:00:05' select * from emp;
  waitfor time '00:00:05' select * from emp;
#+end_src

** print

用来输出字符串到标准输出的。

#+begin_src sql
  print 'hello world';
#+end_src

** raiserror

抛出一个错误。(类似 Java 中的 throw new Exception)

#+begin_src sql
  -- 一个有瑕疵的例子

  declare @emsg varchar(200), @ecode int;
  set @emsg = 'xxx';
  set @ecode = 404;

  raiserror('发生了一个错误: %s (%s)', @emsg, @ecode);
#+end_src

** case-when (很重要)

类似于 Switch:

#+begin_src sql
  -- 列出每个员工的基本工资情况
  select ename,
         case
           when sal < 1500 then '很少'
           when sal < 3000 then '可以'
           else '太多了'
         end as '工资情况'
   from emp;

  -- 给所有人加工资
  --  如果工资小于 1500 加上 1000
  --  如果工资小于 3000 加上 500
  --  如果工资大于等于 3000 加上 50
  update emp set sal = sal + 
                        (case 
                          when sal < 1500 then 1000
                          when sal < 3000 then 500
                          else 50
                         end);
#+end_src

* 函数 (Function)
** 什么是函数

- 黑箱子
- 有输入，有输出
- 无副作用

