html/SQLServer/d-tsql.html

<section id="outline-container-orgc39681d" class="outline-2">
<h2 id="orgc39681d"><span class="section-number-2">3</span> 逻辑处理</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgbebad28" class="outline-3">
<h3 id="orgbebad28"><span class="section-number-3">3.1</span> if/else</h3>
<div class="outline-text-3" id="text-3-1">
<p>
基本句式:
</p>
<div class="org-src-container">
<pre class="src src-sql">if &#26465;&#20214;
  &#25805;&#20316;
<span style="color: #c678dd; font-weight: bold;">else</span> if
  &#25805;&#20316;
<span style="color: #c678dd; font-weight: bold;">else</span>
  &#25805;&#20316;
</pre>
</div>

<p>
例子:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#32473;&#26576;&#20010;&#20154;&#21152;&#24037;&#36164; (7499)</span>
<span style="color: #687080; font-style: italic;">--  &#22914;&#26524;&#24037;&#36164;&#23567;&#20110; 1500 &#21152;&#19978; 1000</span>
<span style="color: #687080; font-style: italic;">--  &#22914;&#26524;&#24037;&#36164;&#23567;&#20110; 3000 &#21152;&#19978; 500</span>
<span style="color: #687080; font-style: italic;">--  &#22914;&#26524;&#24037;&#36164;&#22823;&#20110;&#31561;&#20110; 3000 &#21152;&#19978; 50</span>

<span style="color: #c678dd; font-weight: bold;">declare</span> @empno <span style="color: #61afef;">int</span>;
<span style="color: #c678dd; font-weight: bold;">set</span> @empno = 7499;

if <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> sal <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> empno = @empno<span style="color: #8c8c8c;">)</span> &lt; 1500
  <span style="color: #c678dd; font-weight: bold;">begin</span>
    <span style="color: #c678dd; font-weight: bold;">update</span> emp <span style="color: #c678dd; font-weight: bold;">set</span> sal = sal + 1000 <span style="color: #c678dd; font-weight: bold;">where</span> empno = @empno;
    <span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> my_log <span style="color: #8c8c8c;">(</span>message<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'money is so cool.'</span><span style="color: #8c8c8c;">)</span>;
  <span style="color: #c678dd; font-weight: bold;">end</span>
<span style="color: #c678dd; font-weight: bold;">else</span> if <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> sal <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> empno = @empno<span style="color: #8c8c8c;">)</span> &lt; 3000
  <span style="color: #c678dd; font-weight: bold;">begin</span>
    <span style="color: #c678dd; font-weight: bold;">update</span> emp <span style="color: #c678dd; font-weight: bold;">set</span> sal = sal + 500 <span style="color: #c678dd; font-weight: bold;">where</span> empno = @empno;
    <span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> my_log <span style="color: #8c8c8c;">(</span>message<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'what a pity.'</span><span style="color: #8c8c8c;">)</span>;
  <span style="color: #c678dd; font-weight: bold;">end</span>
<span style="color: #c678dd; font-weight: bold;">else</span>
  <span style="color: #c678dd; font-weight: bold;">begin</span>
    <span style="color: #c678dd; font-weight: bold;">update</span> emp <span style="color: #c678dd; font-weight: bold;">set</span> sal = sal + 50 <span style="color: #c678dd; font-weight: bold;">where</span> empno = @empno;
    <span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> my_log <span style="color: #8c8c8c;">(</span>message<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'fxxxxxk.'</span><span style="color: #8c8c8c;">)</span>;
  <span style="color: #c678dd; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb25c1c7" class="outline-3">
<h3 id="orgb25c1c7"><span class="section-number-3">3.2</span> while</h3>
<div class="outline-text-3" id="text-3-2">
<p>
基本句式:
</p>
<div class="org-src-container">
<pre class="src src-sql">while &#26465;&#20214;
  &#35821;&#21477;
</pre>
</div>

<p>
示例:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#21521;&#25968;&#25454;&#24211;&#20013;&#25554;&#20837; 1000000 &#26465;&#27979;&#35797;&#25968;&#25454;</span>

<span style="color: #c678dd; font-weight: bold;">declare</span> @<span style="color: #61afef; font-weight: bold;">count</span> <span style="color: #61afef;">int</span>;
<span style="color: #c678dd; font-weight: bold;">set</span> @<span style="color: #61afef; font-weight: bold;">count</span> = 1000000;
while @<span style="color: #61afef; font-weight: bold;">count</span> &gt; 0
  <span style="color: #c678dd; font-weight: bold;">begin</span>
      <span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> my_log <span style="color: #8c8c8c;">(</span>message<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'hello'</span><span style="color: #8c8c8c;">)</span>;
      <span style="color: #c678dd; font-weight: bold;">set</span> @<span style="color: #61afef; font-weight: bold;">count</span> = @<span style="color: #61afef; font-weight: bold;">count</span> - 1
  <span style="color: #c678dd; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf202a7" class="outline-3">
<h3 id="orgcf202a7"><span class="section-number-3">3.3</span> return/returns</h3>
<div class="outline-text-3" id="text-3-3">
<p>
无条件返回。
</p>
</div>
</div>

<div id="outline-container-orgad1e10e" class="outline-3">
<h3 id="orgad1e10e"><span class="section-number-3">3.4</span> waitfor</h3>
<div class="outline-text-3" id="text-3-4">
<p>
计时器，可以指定计划任务，比如，晚上对数据做一些统计性的工作。
</p>

<div class="org-src-container">
<pre class="src src-sql">waitfor delay <span style="color: #98be65;">'00:00:05'</span> <span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp;
waitfor <span style="color: #61afef;">time</span> <span style="color: #98be65;">'00:00:05'</span> <span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb95838c" class="outline-3">
<h3 id="orgb95838c"><span class="section-number-3">3.5</span> print</h3>
<div class="outline-text-3" id="text-3-5">
<p>
用来输出字符串到标准输出的。
</p>

<div class="org-src-container">
<pre class="src src-sql">print <span style="color: #98be65;">'hello world'</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb75f8d5" class="outline-3">
<h3 id="orgb75f8d5"><span class="section-number-3">3.6</span> raiserror</h3>
<div class="outline-text-3" id="text-3-6">
<p>
抛出一个错误。(类似 Java 中的 throw new Exception)
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#19968;&#20010;&#26377;&#29781;&#30133;&#30340;&#20363;&#23376;</span>

<span style="color: #c678dd; font-weight: bold;">declare</span> @emsg <span style="color: #61afef;">varchar</span><span style="color: #8c8c8c;">(</span>200<span style="color: #8c8c8c;">)</span>, @ecode <span style="color: #61afef;">int</span>;
<span style="color: #c678dd; font-weight: bold;">set</span> @emsg = <span style="color: #98be65;">'xxx'</span>;
<span style="color: #c678dd; font-weight: bold;">set</span> @ecode = 404;

raiserror<span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'&#21457;&#29983;&#20102;&#19968;&#20010;&#38169;&#35823;: %s (%s)'</span>, @emsg, @ecode<span style="color: #8c8c8c;">)</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org651c5dc" class="outline-3">
<h3 id="org651c5dc"><span class="section-number-3">3.7</span> case-when (很重要)</h3>
<div class="outline-text-3" id="text-3-7">
<p>
类似于 Switch:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#21015;&#20986;&#27599;&#20010;&#21592;&#24037;&#30340;&#22522;&#26412;&#24037;&#36164;&#24773;&#20917;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> ename,
       <span style="color: #c678dd; font-weight: bold;">case</span>
         <span style="color: #c678dd; font-weight: bold;">when</span> sal &lt; 1500 <span style="color: #c678dd; font-weight: bold;">then</span> <span style="color: #98be65;">'&#24456;&#23569;'</span>
         <span style="color: #c678dd; font-weight: bold;">when</span> sal &lt; 3000 <span style="color: #c678dd; font-weight: bold;">then</span> <span style="color: #98be65;">'&#21487;&#20197;'</span>
         <span style="color: #c678dd; font-weight: bold;">else</span> <span style="color: #98be65;">'&#22826;&#22810;&#20102;'</span>
       <span style="color: #c678dd; font-weight: bold;">end</span> <span style="color: #c678dd; font-weight: bold;">as</span> <span style="color: #98be65;">'&#24037;&#36164;&#24773;&#20917;'</span>
 <span style="color: #c678dd; font-weight: bold;">from</span> emp;

<span style="color: #687080; font-style: italic;">-- &#32473;&#25152;&#26377;&#20154;&#21152;&#24037;&#36164;</span>
<span style="color: #687080; font-style: italic;">--  &#22914;&#26524;&#24037;&#36164;&#23567;&#20110; 1500 &#21152;&#19978; 1000</span>
<span style="color: #687080; font-style: italic;">--  &#22914;&#26524;&#24037;&#36164;&#23567;&#20110; 3000 &#21152;&#19978; 500</span>
<span style="color: #687080; font-style: italic;">--  &#22914;&#26524;&#24037;&#36164;&#22823;&#20110;&#31561;&#20110; 3000 &#21152;&#19978; 50</span>
<span style="color: #c678dd; font-weight: bold;">update</span> emp <span style="color: #c678dd; font-weight: bold;">set</span> sal = sal +
                      <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">case</span>
                        <span style="color: #c678dd; font-weight: bold;">when</span> sal &lt; 1500 <span style="color: #c678dd; font-weight: bold;">then</span> 1000
                        <span style="color: #c678dd; font-weight: bold;">when</span> sal &lt; 3000 <span style="color: #c678dd; font-weight: bold;">then</span> 500
                        <span style="color: #c678dd; font-weight: bold;">else</span> 50
                       <span style="color: #c678dd; font-weight: bold;">end</span><span style="color: #8c8c8c;">)</span>;
</pre>
</div>
</div>
</div>
</section>
