.src/SQLServer/d-tsql.org
** 创建函数

- 创建使用 create function
- 删除使用 drop function
- 修改使用 alter function
- 调用使用 select 或 exec
- 函数内部不能使用 print/insert 等带有副作用的语句

#+begin_src sql
  -- 创建一个基本函数，查询部门平均工资
  -- 对比 Java 中的 int pingjungongzi (int deptno)
  create function pingjungongzi (@deptno int) returns int
    as
    begin
      declare @avgsal int;
      select @avgsal = avg(sal) from emp where deptno = @deptno;
      return @avgsal;
    end;

  -- 调用刚才的函数
  select dbo.pingjungongzi(20);
  -- 或
  declare @s int;
  exec @s = pingjungongzi 20;

  -- 删除
  drop function pingjungongzi;
#+end_src

** 内置函数
*** 数学函数

- abs/ascii/avg/log/power/exp/PI/round/ceiling/floor()
- rand() !!!

*** 字符串相关

- len/datalength() !!!
- str/substring()
- left/right/replicate/reverse()

*** 日期相关

- getdate() !!
- datename/dateadd/datediff/day/month/year()

使用 sql 计算一下，入学第一年，每天花费多少钱 (2019-8-5 ~ 2020-8-7)？
#+begin_src sql
  select 32000/datediff(day,'2019-08-05','2020-08-07');
#+end_src

计算一下，你现在活了多少秒。

*** 类型转换 (cast/convert) !!!

基本语法:
#+begin_example
  -- CAST Syntax:  
  CAST ( expression AS data_type [ ( length ) ] )  
  
  -- CONVERT Syntax:  
  CONVERT ( data_type [ ( length ) ] , expression [ , style ] )  
#+end_example

基本示例:
#+begin_src sql
  select cast('12345' as int);
  select cast('2012-3-4' as datetime);

  select convert(varchar(19), getdate());
  select convert(varchar(19), getdate(), 20); -- yyyy-mm-dd hh:mi:ss
  select convert(varchar(10), getdate(), 110);
  select convert(varchar(11), getdate(), 106);
  select convert(varchar(24), getdate(), 113);
#+end_src

https://docs.microsoft.com/zh-cn/sql/t-sql/functions/cast-and-convert-transact-sql?view=sql-server-ver15

*** 其他

- isnull()

* 存储过程 (Procedure)
** 什么是存储过程

将一系列进行处理的语句过程保存下来，后面可以复用。

有很多好处:
- 它允许标准组件化编程
- 能够实现更快的执行速度
- 能够减少网络流量
- 可以保障安全机制

有什么坏处:
- 【强制】禁止使用存储过程，存储过程难以调试和扩展，更没有移植性

** 创建存储过程
*** 基本语句

#+begin_src sql
  -- 创建
  create procedure p_aa1 as
    create table xxx (a int, b varchar(20));
    insert into xxx values (1, 2), (2, 3), (3, 4);
    select * from xxx;
    waitfor delay '00:00:20' drop table xxx;
  GO

  -- 执行
  exec p_aa1;
  GO

  -- 删除
  drop procedure p_aa1;
  drop proc p_aa1;

  -- 修改
  alter procedure p_aa1 as
    select * from emp;
#+end_src

