html/SQLServer/d-tsql.html

<section id="outline-container-org1c56ac1" class="outline-2">
<h2 id="org1c56ac1"><span class="section-number-2">4</span> 函数 (Function)</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge707bd2" class="outline-3">
<h3 id="orge707bd2"><span class="section-number-3">4.1</span> 什么是函数</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>黑箱子</li>
<li>有输入，有输出</li>
<li>无副作用</li>
</ul>
</div>
</div>

<div id="outline-container-org2694676" class="outline-3">
<h3 id="org2694676"><span class="section-number-3">4.2</span> 创建函数</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>创建使用 create function</li>
<li>删除使用 drop function</li>
<li>修改使用 alter function</li>
<li>调用使用 select 或 exec</li>
<li>函数内部不能使用 print/insert 等带有副作用的语句</li>
</ul>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#21019;&#24314;&#19968;&#20010;&#22522;&#26412;&#20989;&#25968;&#65292;&#26597;&#35810;&#37096;&#38376;&#24179;&#22343;&#24037;&#36164;</span>
<span style="color: #687080; font-style: italic;">-- &#23545;&#27604; Java &#20013;&#30340; int pingjungongzi (int deptno)</span>
<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef;">pingjungongzi</span> <span style="color: #8c8c8c;">(</span>@deptno <span style="color: #61afef;">int</span><span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">returns</span> <span style="color: #61afef;">int</span>
  <span style="color: #c678dd; font-weight: bold;">as</span>
  <span style="color: #c678dd; font-weight: bold;">begin</span>
    <span style="color: #c678dd; font-weight: bold;">declare</span> @avgsal <span style="color: #61afef;">int</span>;
    <span style="color: #c678dd; font-weight: bold;">select</span> @avgsal = <span style="color: #61afef; font-weight: bold;">avg</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> deptno = @deptno;
    <span style="color: #c678dd; font-weight: bold;">return</span> @avgsal;
  <span style="color: #c678dd; font-weight: bold;">end</span>;

<span style="color: #687080; font-style: italic;">-- &#35843;&#29992;&#21018;&#25165;&#30340;&#20989;&#25968;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> dbo.pingjungongzi<span style="color: #8c8c8c;">(</span>20<span style="color: #8c8c8c;">)</span>;
<span style="color: #687080; font-style: italic;">-- &#25110;</span>
<span style="color: #c678dd; font-weight: bold;">declare</span> @s <span style="color: #61afef;">int</span>;
<span style="color: #c678dd; font-weight: bold;">exec</span> @s = pingjungongzi 20;

<span style="color: #687080; font-style: italic;">-- &#21024;&#38500;</span>
<span style="color: #c678dd; font-weight: bold;">drop</span> <span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef;">pingjungongzi</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org909ed82" class="outline-3">
<h3 id="org909ed82"><span class="section-number-3">4.3</span> 内置函数</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-orgc008341" class="outline-4">
<h4 id="orgc008341"><span class="section-number-4">4.3.1</span> 数学函数</h4>
<div class="outline-text-4" id="text-4-3-1">
<ul class="org-ul">
<li>abs/ascii/avg/log/power/exp/PI/round/ceiling/floor()</li>
<li>rand() !!!</li>
</ul>
</div>
</div>

<div id="outline-container-org4adf561" class="outline-4">
<h4 id="org4adf561"><span class="section-number-4">4.3.2</span> 字符串相关</h4>
<div class="outline-text-4" id="text-4-3-2">
<ul class="org-ul">
<li>len/datalength() !!!</li>
<li>str/substring()</li>
<li>left/right/replicate/reverse()</li>
</ul>
</div>
</div>

<div id="outline-container-org900850b" class="outline-4">
<h4 id="org900850b"><span class="section-number-4">4.3.3</span> 日期相关</h4>
<div class="outline-text-4" id="text-4-3-3">
<ul class="org-ul">
<li>getdate() !!</li>
<li>datename/dateadd/datediff/day/month/year()</li>
</ul>

<p>
使用 sql 计算一下，入学第一年，每天花费多少钱 (2019-8-5 ~ 2020-8-7)？
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">select</span> 32000/datediff<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">day</span>,<span style="color: #98be65;">'2019-08-05'</span>,<span style="color: #98be65;">'2020-08-07'</span><span style="color: #8c8c8c;">)</span>;
</pre>
</div>

<p>
计算一下，你现在活了多少秒。
</p>
</div>
</div>

<div id="outline-container-org9ddd2bd" class="outline-4">
<h4 id="org9ddd2bd"><span class="section-number-4">4.3.4</span> 类型转换 (cast/convert) !!!</h4>
<div class="outline-text-4" id="text-4-3-4">
<p>
基本语法:
</p>
<pre class="example" id="orge697445">
-- CAST Syntax:
CAST ( expression AS data_type [ ( length ) ] )

-- CONVERT Syntax:
CONVERT ( data_type [ ( length ) ] , expression [ , style ] )
</pre>

<p>
基本示例:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">cast</span><span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'12345'</span> <span style="color: #c678dd; font-weight: bold;">as</span> <span style="color: #61afef;">int</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">cast</span><span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'2012-3-4'</span> <span style="color: #c678dd; font-weight: bold;">as</span> datetime<span style="color: #8c8c8c;">)</span>;

<span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">convert</span><span style="color: #8c8c8c;">(</span><span style="color: #61afef;">varchar</span><span style="color: #93a8c6;">(</span>19<span style="color: #93a8c6;">)</span>, getdate<span style="color: #93a8c6;">()</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">convert</span><span style="color: #8c8c8c;">(</span><span style="color: #61afef;">varchar</span><span style="color: #93a8c6;">(</span>19<span style="color: #93a8c6;">)</span>, getdate<span style="color: #93a8c6;">()</span>, 20<span style="color: #8c8c8c;">)</span>; <span style="color: #687080; font-style: italic;">-- yyyy-mm-dd hh:mi:ss</span>
<span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">convert</span><span style="color: #8c8c8c;">(</span><span style="color: #61afef;">varchar</span><span style="color: #93a8c6;">(</span>10<span style="color: #93a8c6;">)</span>, getdate<span style="color: #93a8c6;">()</span>, 110<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">convert</span><span style="color: #8c8c8c;">(</span><span style="color: #61afef;">varchar</span><span style="color: #93a8c6;">(</span>11<span style="color: #93a8c6;">)</span>, getdate<span style="color: #93a8c6;">()</span>, 106<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">convert</span><span style="color: #8c8c8c;">(</span><span style="color: #61afef;">varchar</span><span style="color: #93a8c6;">(</span>24<span style="color: #93a8c6;">)</span>, getdate<span style="color: #93a8c6;">()</span>, 113<span style="color: #8c8c8c;">)</span>;
</pre>
</div>

<p>
<a href="https://docs.microsoft.com/zh-cn/sql/t-sql/functions/cast-and-convert-transact-sql?view=sql-server-ver15">https://docs.microsoft.com/zh-cn/sql/t-sql/functions/cast-and-convert-transact-sql?view=sql-server-ver15</a>
</p>
</div>
</div>

<div id="outline-container-orgb4b92c8" class="outline-4">
<h4 id="orgb4b92c8"><span class="section-number-4">4.3.5</span> 其他</h4>
<div class="outline-text-4" id="text-4-3-5">
<ul class="org-ul">
<li>isnull()</li>
</ul>
</div>
</div>
</div>
</section>

<section id="outline-container-org20ebb10" class="outline-2">
<h2 id="org20ebb10"><span class="section-number-2">5</span> 存储过程 (Procedure)</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org9e5c5c3" class="outline-3">
<h3 id="org9e5c5c3"><span class="section-number-3">5.1</span> 什么是存储过程</h3>
<div class="outline-text-3" id="text-5-1">
<p>
将一系列进行处理的语句过程保存下来，后面可以复用。
</p>

<p>
有很多好处:
</p>
<ul class="org-ul">
<li>它允许标准组件化编程</li>
<li>能够实现更快的执行速度</li>
<li>能够减少网络流量</li>
<li>可以保障安全机制</li>
</ul>

<p>
有什么坏处:
</p>
<ul class="org-ul">
<li>【强制】禁止使用存储过程，存储过程难以调试和扩展，更没有移植性</li>
</ul>
</div>
</div>

<div id="outline-container-org11a99c8" class="outline-3">
<h3 id="org11a99c8"><span class="section-number-3">5.2</span> 创建存储过程</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-org1142799" class="outline-4">
<h4 id="org1142799"><span class="section-number-4">5.2.1</span> 基本语句</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#21019;&#24314;</span>
<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">procedure</span> <span style="color: #61afef;">p_aa1</span> <span style="color: #c678dd; font-weight: bold;">as</span>
  <span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">xxx</span> <span style="color: #8c8c8c;">(</span>a <span style="color: #61afef;">int</span>, b <span style="color: #61afef;">varchar</span><span style="color: #93a8c6;">(</span>20<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>;
  <span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> xxx <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span>1, 2<span style="color: #8c8c8c;">)</span>, <span style="color: #8c8c8c;">(</span>2, 3<span style="color: #8c8c8c;">)</span>, <span style="color: #8c8c8c;">(</span>3, 4<span style="color: #8c8c8c;">)</span>;
  <span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> xxx;
  waitfor delay <span style="color: #98be65;">'00:00:20'</span> <span style="color: #c678dd; font-weight: bold;">drop</span> <span style="color: #c678dd; font-weight: bold;">table</span> xxx;
<span style="color: #c678dd; font-weight: bold;">GO</span>

<span style="color: #687080; font-style: italic;">-- &#25191;&#34892;</span>
<span style="color: #c678dd; font-weight: bold;">exec</span> p_aa1;
<span style="color: #c678dd; font-weight: bold;">GO</span>

<span style="color: #687080; font-style: italic;">-- &#21024;&#38500;</span>
<span style="color: #c678dd; font-weight: bold;">drop</span> <span style="color: #c678dd; font-weight: bold;">procedure</span> <span style="color: #61afef;">p_aa1</span>;
<span style="color: #c678dd; font-weight: bold;">drop</span> proc <span style="color: #61afef;">p_aa1</span>;

<span style="color: #687080; font-style: italic;">-- &#20462;&#25913;</span>
<span style="color: #c678dd; font-weight: bold;">alter</span> <span style="color: #c678dd; font-weight: bold;">procedure</span> <span style="color: #61afef;">p_aa1</span> <span style="color: #c678dd; font-weight: bold;">as</span>
  <span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp;
</pre>
</div>
</div>
</div>
