.src/SQLServer/d-tsql.org
*** 各种参数

没有参数:
#+begin_src sql
  create procedure p_aaa as select * from xxx;
  exec p_aaa;
#+end_src

带有参数:
#+begin_src sql
  create procedure
    p_aaa @name varchar(20) 
  as
    select * from xxx where name < @name;

  exec p_aaa 30;
#+end_src

带有参数，还有默认值:
#+begin_src sql
  create procedure p_aaa
    @name varchar(20) = 'Tom'
  as
    select * from xxx where name < @name;

  exec p_aaa;
  exec p_aaa 'xxx';
#+end_src

带 output 参数的存储过程:
#+begin_src sql
  create procedure p_aaa
    @r int output
  as
    select @r = count(*) from xxx;

  -- 调用
  declare @rrr int;
  exec p_aaa @rrr output;
#+end_src

混合各种参数:
#+begin_src sql
  create procedure p_aaa
    @n varchar(20) = 'TOM',
    @r int output
  as
    select @r = count(*) from xxx where name < @n;

  -- 调用
  declare @rrr int;
  exec p_aaa 'Cat', @rrr output;

  -- 查看返回的结果
  select @rrr;
#+end_src

** 简单示例 (统计)

为 emp 生成统计数据，统计所有部门的平均工资、最小工资和最大工资，将结果保存到 tj_emp 表中。要求:
- 如果这张表不存在，那么创建
- 如果这张表存在，但是里面有数据，清空它
- 如果插入完成，在日志表 (my_log) 插入一条信息

写法示例:
#+begin_src sql
  create procedure p_tj_emp
    @lowsal int = 1000,
    @highsal int = 10000
  as
  begin
    -- 如果不存在，创建之
    if not exists (select * from sys.tables where name = 'tj_emp')
       create table tj_emp (deptno int, a float, b float, c float);
    -- 清空数据
    truncate table tj_emp;
    -- 插入新的数据
    insert into tj_emp select deptno, avg(sal) as a, max(sal) as b, min(sal) as c from emp
      where sal >= @lowsal and sal <= @highsal
      group by deptno;
    -- 记录日志
    insert into my_log (message) values ('统计完成 - ' + convert(varchar(200), getdate(), 20));
    -- 结束
    print 'hello, finished.';
  end
#+end_src

** 内置存储过程

系统内置的存储过程，一般是 sp_ 开始:
#+begin_src sql
  exec sp_databases;
  exec sp_help;
  exec sp_helptext sp_databases;
  exec sp_helptext sp_helptext; -- 查看存储过程怎么写的

  exec sp_tables;
  exec sp_columns emp;
#+end_src

扩展出来的存储过程以 xp_ 开始:
#+begin_src sql
  exec xp_cmdshell 'mkdir e:\hello';
  exec xp_fileexist 'e:\hello';

  -- xp_enumgroups;
  -- xp_loginconfig
  -- xp_msver
  -- xp_grantlogin;
  -- ...
#+end_src

* 触发器 (Trigger)
** 什么是触发器

类似于 JS 中的事件:
- 强制数据库间的引用完整性
- 可以执行级联操作等动作
- 可以防止误操作

坏处:
- 不透明，有风险，需慎用

