html/SQLServer/d-tsql.html

<div id="outline-container-orge736edb" class="outline-4">
<h4 id="orge736edb"><span class="section-number-4">5.2.2</span> 各种参数</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
没有参数:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">procedure</span> <span style="color: #61afef;">p_aaa</span> <span style="color: #c678dd; font-weight: bold;">as</span> <span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> xxx;
<span style="color: #c678dd; font-weight: bold;">exec</span> p_aaa;
</pre>
</div>

<p>
带有参数:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">procedure</span>
  p_aaa @<span style="color: #c678dd; font-weight: bold;">name</span> <span style="color: #61afef;">varchar</span><span style="color: #8c8c8c;">(</span>20<span style="color: #8c8c8c;">)</span>
<span style="color: #c678dd; font-weight: bold;">as</span>
  <span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> xxx <span style="color: #c678dd; font-weight: bold;">where</span> <span style="color: #c678dd; font-weight: bold;">name</span> &lt; @<span style="color: #c678dd; font-weight: bold;">name</span>;

<span style="color: #c678dd; font-weight: bold;">exec</span> p_aaa 30;
</pre>
</div>

<p>
带有参数，还有默认值:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">procedure</span> <span style="color: #61afef;">p_aaa</span>
  @<span style="color: #c678dd; font-weight: bold;">name</span> <span style="color: #61afef;">varchar</span><span style="color: #8c8c8c;">(</span>20<span style="color: #8c8c8c;">)</span> = <span style="color: #98be65;">'Tom'</span>
<span style="color: #c678dd; font-weight: bold;">as</span>
  <span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> xxx <span style="color: #c678dd; font-weight: bold;">where</span> <span style="color: #c678dd; font-weight: bold;">name</span> &lt; @<span style="color: #c678dd; font-weight: bold;">name</span>;

<span style="color: #c678dd; font-weight: bold;">exec</span> p_aaa;
<span style="color: #c678dd; font-weight: bold;">exec</span> p_aaa <span style="color: #98be65;">'xxx'</span>;
</pre>
</div>

<p>
带 output 参数的存储过程:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">procedure</span> <span style="color: #61afef;">p_aaa</span>
  @r <span style="color: #61afef;">int</span> <span style="color: #c678dd; font-weight: bold;">output</span>
<span style="color: #c678dd; font-weight: bold;">as</span>
  <span style="color: #c678dd; font-weight: bold;">select</span> @r = <span style="color: #61afef; font-weight: bold;">count</span><span style="color: #8c8c8c;">(</span>*<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> xxx;

<span style="color: #687080; font-style: italic;">-- &#35843;&#29992;</span>
<span style="color: #c678dd; font-weight: bold;">declare</span> @rrr <span style="color: #61afef;">int</span>;
<span style="color: #c678dd; font-weight: bold;">exec</span> p_aaa @rrr <span style="color: #c678dd; font-weight: bold;">output</span>;
</pre>
</div>

<p>
混合各种参数:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">procedure</span> <span style="color: #61afef;">p_aaa</span>
  @n <span style="color: #61afef;">varchar</span><span style="color: #8c8c8c;">(</span>20<span style="color: #8c8c8c;">)</span> = <span style="color: #98be65;">'TOM'</span>,
  @r <span style="color: #61afef;">int</span> <span style="color: #c678dd; font-weight: bold;">output</span>
<span style="color: #c678dd; font-weight: bold;">as</span>
  <span style="color: #c678dd; font-weight: bold;">select</span> @r = <span style="color: #61afef; font-weight: bold;">count</span><span style="color: #8c8c8c;">(</span>*<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> xxx <span style="color: #c678dd; font-weight: bold;">where</span> <span style="color: #c678dd; font-weight: bold;">name</span> &lt; @n;

<span style="color: #687080; font-style: italic;">-- &#35843;&#29992;</span>
<span style="color: #c678dd; font-weight: bold;">declare</span> @rrr <span style="color: #61afef;">int</span>;
<span style="color: #c678dd; font-weight: bold;">exec</span> p_aaa <span style="color: #98be65;">'Cat'</span>, @rrr <span style="color: #c678dd; font-weight: bold;">output</span>;

<span style="color: #687080; font-style: italic;">-- &#26597;&#30475;&#36820;&#22238;&#30340;&#32467;&#26524;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> @rrr;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd882344" class="outline-3">
<h3 id="orgd882344"><span class="section-number-3">5.3</span> 简单示例 (统计)</h3>
<div class="outline-text-3" id="text-5-3">
<p>
为 emp 生成统计数据，统计所有部门的平均工资、最小工资和最大工资，将结果保存到 tj_emp 表中。要求:
</p>
<ul class="org-ul">
<li>如果这张表不存在，那么创建</li>
<li>如果这张表存在，但是里面有数据，清空它</li>
<li>如果插入完成，在日志表 (my_log) 插入一条信息</li>
</ul>

<p>
写法示例:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">procedure</span> <span style="color: #61afef;">p_tj_emp</span>
  @lowsal <span style="color: #61afef;">int</span> = 1000,
  @highsal <span style="color: #61afef;">int</span> = 10000
<span style="color: #c678dd; font-weight: bold;">as</span>
<span style="color: #c678dd; font-weight: bold;">begin</span>
  <span style="color: #687080; font-style: italic;">-- &#22914;&#26524;&#19981;&#23384;&#22312;&#65292;&#21019;&#24314;&#20043;</span>
  if <span style="color: #c678dd; font-weight: bold;">not</span> <span style="color: #c678dd; font-weight: bold;">exists</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> sys.tables <span style="color: #c678dd; font-weight: bold;">where</span> <span style="color: #c678dd; font-weight: bold;">name</span> = <span style="color: #98be65;">'tj_emp'</span><span style="color: #8c8c8c;">)</span>
     <span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">tj_emp</span> <span style="color: #8c8c8c;">(</span>deptno <span style="color: #61afef;">int</span>, a <span style="color: #61afef;">float</span>, b <span style="color: #61afef;">float</span>, c <span style="color: #61afef;">float</span><span style="color: #8c8c8c;">)</span>;
  <span style="color: #687080; font-style: italic;">-- &#28165;&#31354;&#25968;&#25454;</span>
  truncate <span style="color: #c678dd; font-weight: bold;">table</span> tj_emp;
  <span style="color: #687080; font-style: italic;">-- &#25554;&#20837;&#26032;&#30340;&#25968;&#25454;</span>
  <span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> tj_emp <span style="color: #c678dd; font-weight: bold;">select</span> deptno, <span style="color: #61afef; font-weight: bold;">avg</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> a, <span style="color: #61afef; font-weight: bold;">max</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> b, <span style="color: #61afef; font-weight: bold;">min</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> c <span style="color: #c678dd; font-weight: bold;">from</span> emp
    <span style="color: #c678dd; font-weight: bold;">where</span> sal &gt;= @lowsal <span style="color: #c678dd; font-weight: bold;">and</span> sal &lt;= @highsal
    <span style="color: #c678dd; font-weight: bold;">group</span> <span style="color: #c678dd; font-weight: bold;">by</span> deptno;
  <span style="color: #687080; font-style: italic;">-- &#35760;&#24405;&#26085;&#24535;</span>
  <span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> my_log <span style="color: #8c8c8c;">(</span>message<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'&#32479;&#35745;&#23436;&#25104; - '</span> + <span style="color: #61afef; font-weight: bold;">convert</span><span style="color: #93a8c6;">(</span><span style="color: #61afef;">varchar</span><span style="color: #b0b1a3;">(</span>200<span style="color: #b0b1a3;">)</span>, getdate<span style="color: #b0b1a3;">()</span>, 20<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>;
  <span style="color: #687080; font-style: italic;">-- &#32467;&#26463;</span>
  print <span style="color: #98be65;">'hello, finished.'</span>;
<span style="color: #c678dd; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1a5971b" class="outline-3">
<h3 id="org1a5971b"><span class="section-number-3">5.4</span> 内置存储过程</h3>
<div class="outline-text-3" id="text-5-4">
<p>
系统内置的存储过程，一般是 sp_ 开始:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">exec</span> sp_databases;
<span style="color: #c678dd; font-weight: bold;">exec</span> sp_help;
<span style="color: #c678dd; font-weight: bold;">exec</span> sp_helptext sp_databases;
<span style="color: #c678dd; font-weight: bold;">exec</span> sp_helptext sp_helptext; <span style="color: #687080; font-style: italic;">-- &#26597;&#30475;&#23384;&#20648;&#36807;&#31243;&#24590;&#20040;&#20889;&#30340;</span>

<span style="color: #c678dd; font-weight: bold;">exec</span> sp_tables;
<span style="color: #c678dd; font-weight: bold;">exec</span> sp_columns emp;
</pre>
</div>

<p>
扩展出来的存储过程以 xp_ 开始:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">exec</span> xp_cmdshell <span style="color: #98be65;">'mkdir e:\hello'</span>;
<span style="color: #c678dd; font-weight: bold;">exec</span> xp_fileexist <span style="color: #98be65;">'e:\hello'</span>;

<span style="color: #687080; font-style: italic;">-- xp_enumgroups;</span>
<span style="color: #687080; font-style: italic;">-- xp_loginconfig</span>
<span style="color: #687080; font-style: italic;">-- xp_msver</span>
<span style="color: #687080; font-style: italic;">-- xp_grantlogin;</span>
<span style="color: #687080; font-style: italic;">-- ...</span>
</pre>
</div>
</div>
</div>
</section>
