.src/SQLServer/d-tsql.org
** 创建触发器

Insert 触发器:
#+begin_src sql
  -- 触发器
  create trigger tri_emp_insert_jiagongzi
    on emp
    after insert
  as -- inserted 表示插入的数据形成的临时表，名字就叫 inserted
    update emp set sal = sal + 100 where empno = (select mgr from inserted);

  -- 测试
  select * from emp;
  insert into emp (empno, ename, mgr, deptno, sal)
    values (999, 'ganmaoling', 7902, 10, 2000);
#+end_src

Delete 触发器:
#+begin_src sql
  -- select * into emp_hist from emp;
  -- select * from emp_hist;
  -- truncate table emp_hist;

  create trigger tri_emp_delete_history
    on emp
    after delete
  as -- deleted, 所有删除的数据形成的临时表
    insert into emp_hist select * from deleted;
#+end_src

Drop 触发器:
#+begin_src sql
  -- 禁止删除表、视图等
  create trigger tri_emp_no_drop
      on database
      for drop_table, drop_view, drop_procedure
  as
  begin
      print '您不能这样啊~~~~~';
      rollback transaction;
  end

  -- 测试
  drop table emp;
#+end_src

* 常见问题

- 什么是函数？
- 什么是存储过程？
- 什么是触发器？
- 函数、存储过程和触发器有什么区别？
- 函数、存储过程和触发器各有什么优点、缺点？
- 存储过程的参数类型有哪些？
- 写一个简单的存储过程，做一件 xxx 事 (统计一下 lagou_position 表中珠海的某些数据)
- 写一个简单的触发器，完成某种效果 (比如禁止删除某些数据，比如做一些统计性工作)

