html/SQLServer/d-tsql.html

<section id="outline-container-org26058ee" class="outline-2">
<h2 id="org26058ee"><span class="section-number-2">6</span> 触发器 (Trigger)</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org7f508b1" class="outline-3">
<h3 id="org7f508b1"><span class="section-number-3">6.1</span> 什么是触发器</h3>
<div class="outline-text-3" id="text-6-1">
<p>
类似于 JS 中的事件:
</p>
<ul class="org-ul">
<li>强制数据库间的引用完整性</li>
<li>可以执行级联操作等动作</li>
<li>可以防止误操作</li>
</ul>

<p>
坏处:
</p>
<ul class="org-ul">
<li>不透明，有风险，需慎用</li>
</ul>
</div>
</div>

<div id="outline-container-orgfb4632c" class="outline-3">
<h3 id="orgfb4632c"><span class="section-number-3">6.2</span> 创建触发器</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Insert 触发器:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#35302;&#21457;&#22120;</span>
<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">trigger</span> <span style="color: #61afef;">tri_emp_insert_jiagongzi</span>
  <span style="color: #c678dd; font-weight: bold;">on</span> emp
  <span style="color: #c678dd; font-weight: bold;">after</span> <span style="color: #c678dd; font-weight: bold;">insert</span>
<span style="color: #c678dd; font-weight: bold;">as</span> <span style="color: #687080; font-style: italic;">-- inserted &#34920;&#31034;&#25554;&#20837;&#30340;&#25968;&#25454;&#24418;&#25104;&#30340;&#20020;&#26102;&#34920;&#65292;&#21517;&#23383;&#23601;&#21483; inserted</span>
  <span style="color: #c678dd; font-weight: bold;">update</span> emp <span style="color: #c678dd; font-weight: bold;">set</span> sal = sal + 100 <span style="color: #c678dd; font-weight: bold;">where</span> empno = <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> mgr <span style="color: #c678dd; font-weight: bold;">from</span> inserted<span style="color: #8c8c8c;">)</span>;

<span style="color: #687080; font-style: italic;">-- &#27979;&#35797;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp;
<span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> emp <span style="color: #8c8c8c;">(</span>empno, ename, mgr, deptno, sal<span style="color: #8c8c8c;">)</span>
  <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span>999, <span style="color: #98be65;">'ganmaoling'</span>, 7902, 10, 2000<span style="color: #8c8c8c;">)</span>;
</pre>
</div>

<p>
Delete 触发器:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- select * into emp_hist from emp;</span>
<span style="color: #687080; font-style: italic;">-- select * from emp_hist;</span>
<span style="color: #687080; font-style: italic;">-- truncate table emp_hist;</span>

<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">trigger</span> <span style="color: #61afef;">tri_emp_delete_history</span>
  <span style="color: #c678dd; font-weight: bold;">on</span> emp
  <span style="color: #c678dd; font-weight: bold;">after</span> <span style="color: #c678dd; font-weight: bold;">delete</span>
<span style="color: #c678dd; font-weight: bold;">as</span> <span style="color: #687080; font-style: italic;">-- deleted, &#25152;&#26377;&#21024;&#38500;&#30340;&#25968;&#25454;&#24418;&#25104;&#30340;&#20020;&#26102;&#34920;</span>
  <span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> emp_hist <span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> deleted;
</pre>
</div>

<p>
Drop 触发器:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#31105;&#27490;&#21024;&#38500;&#34920;&#12289;&#35270;&#22270;&#31561;</span>
<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">trigger</span> <span style="color: #61afef;">tri_emp_no_drop</span>
    <span style="color: #c678dd; font-weight: bold;">on</span> database
    <span style="color: #c678dd; font-weight: bold;">for</span> drop_table, drop_view, drop_procedure
<span style="color: #c678dd; font-weight: bold;">as</span>
<span style="color: #c678dd; font-weight: bold;">begin</span>
    print <span style="color: #98be65;">'&#24744;&#19981;&#33021;&#36825;&#26679;&#21834;~~~~~'</span>;
    <span style="color: #c678dd; font-weight: bold;">rollback</span> <span style="color: #c678dd; font-weight: bold;">transaction</span>;
<span style="color: #c678dd; font-weight: bold;">end</span>

<span style="color: #687080; font-style: italic;">-- &#27979;&#35797;</span>
<span style="color: #c678dd; font-weight: bold;">drop</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">emp</span>;
</pre>
</div>
</div>
</div>
</section>

<section id="outline-container-org167f2d1" class="outline-2">
<h2 id="org167f2d1"><span class="section-number-2">7</span> 常见问题</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>什么是函数？</li>
<li>什么是存储过程？</li>
<li>什么是触发器？</li>
<li>函数、存储过程和触发器有什么区别？</li>
<li>函数、存储过程和触发器各有什么优点、缺点？</li>
<li>存储过程的参数类型有哪些？</li>
<li>写一个简单的存储过程，做一件 xxx 事 (统计一下 lagou_position 表中珠海的某些数据)</li>
<li>写一个简单的触发器，完成某种效果 (比如禁止删除某些数据，比如做一些统计性工作)</li>
</ul>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2021-01-22</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
